package com.huyouxiao.space.zhouyi.enums;

public enum BoneTableEnum {
  BONE_2_1(2, 1, "短命非业谓大空，平生灾难事重重；凶祸频临陷逆境，终世困苦事不成。"),
  BONE_2_2(2, 2, "身寒骨冷苦伶仃，此命推来行乞人；劳劳碌碌无度日，终年打拱过平生。"),
  BONE_2_3(2, 3, "此命推来骨格轻，求谋作事事难成；妻儿兄弟应难许，别处他乡作散人。"),
  BONE_2_4(2, 4, "此命推来福禄无，门庭困苦总难荣；六亲骨肉皆无靠，流浪他乡作老翁。"),
  BONE_2_5(2, 5, "此命推来祖业微，门庭营度似稀奇；六亲骨肉如冰炭，一世勤劳自把持。"),
  BONE_2_6(2, 6, "平生衣禄苦中求，独自营谋事不休；离祖出门宜早计，晚来衣禄自无休。"),
  BONE_2_7(2, 7, "一生作事少商量，难靠祖宗作主张；独马单枪空做去，早年晚岁总无长。"),
  BONE_2_8(2, 8, "一生行事似飘蓬，祖宗产业在梦中；若不过房改名姓，也当移徒二三通。"),
  BONE_2_9(2, 9, "初年运限未曾亨，纵有功名在后成；须过四旬才可立，移居改姓始为良。"),
  BONE_3_0(3, 0, "劳劳碌碌苦中求，东奔西走何日休；若使终身勤与俭，老来稍可免忧愁。"),
  BONE_3_1(3, 1, "忙忙碌碌苦中求，何日云开见日头；难得祖基家可立，中年衣食渐无忧。"),
  BONE_3_2(3, 2, "初年运蹇事难谋，渐有财源如水流；到得中年衣食旺，那时名利一齐收。"),
  BONE_3_3(3, 3, "早年做事事难成，百年勤劳枉费心；半世自如流水去，后来运到始得金。"),
  BONE_3_4(3, 4, "此命福气果如何，僧道门中衣禄多；离祖出家方为妙，朝晚拜佛念弥陀。"),
  BONE_3_5(3, 5, "生平福量不周全，祖业根基觉少传；营事生涯宜守旧，时来衣食胜从前。"),
  BONE_3_6(3, 6, "不须劳碌过平生，独自成家福不轻；早有福星常照命，任君行去百般成。"),
  BONE_3_7(3, 7, "此命般般事不成、弟兄少力自孤行；虽然祖业须微有，来得明时去不明。"),
  BONE_3_8(3, 8, "一身骨肉最清高，早入簧门姓氏标；待到年将三十六，蓝衫脱去换红袍。"),
  BONE_3_9(3, 9, "此命终身运不通，劳劳作事尽皆空；苦心竭力成家计，到得那时在梦中。"),
  BONE_4_0(4, 0, "平生衣禄是绵长，件件心中自主张；前面风霜多受过，后来必定享安康。"),
  BONE_4_1(4, 1, "此命推来自不同，为人能干异凡庸；中年还有逍遥福：不比前时运来通。"),
  BONE_4_2(4, 2, "得宽怀处且宽怀，何用双眉皱不开；若使中年命运济，那时名利一起来。"),
  BONE_4_3(4, 3, "为人心性最聪明，作事轩昂近贵人；衣禄一生天注定，不须劳碌是丰亨。"),
  BONE_4_4(4, 4, "万事由天莫苦求，须知福碌赖人修；当年财帛难如意，晚景欣然便不优。"),
  BONE_4_5(4, 5, "名利推求竟若何? 前番辛苦后奔波；命中难养男和女，骨肉扶持也不多。"),
  BONE_4_6(4, 6, "东西南北尽皆通，出姓移居更觉隆；衣禄无穷无数定，中年晚景一般同。"),
  BONE_4_7(4, 7, "此命推求旺末年，妻荣子贵自怡然；平生原有滔滔福，可卜财源若水泉。"),
  BONE_4_8(4, 8, "初年运道未曾通，几许蹉跎命亦穷；兄弟六亲无依靠，一生事业晚来整。"),
  BONE_4_9(4, 9, "此命推来福不轻，自成自立显门庭；从来富贵人钦敬，使婢差奴过一生。"),
  BONE_5_0(5, 0, "为利为名终日劳，中年福禄也多遭；老来自有财星照，不比前番目下高。"),
  BONE_5_1(5, 1, "一世荣华事事通，不须劳碌自亨通；兄弟叔侄皆如意，家业成时福禄宏。"),
  BONE_5_2(5, 2, "一世亨通事事能，不须劳苦自然宁；宗族有光欣喜甚，家产丰盈自称心。"),
  BONE_5_3(5, 3, "此格推来福泽宏，兴家立业在其中；一生衣食安排定，却是人间一福翁。"),
  BONE_5_4(5, 4, "此格详采福泽宏，诗书满腹看功成；丰衣足食多安稳，正是人间有福人。"),
  BONE_5_5(5, 5, "策马扬鞭争名利，少年作事费筹论；一朝福禄源源至，富贵荣华显六亲。"),
  BONE_5_6(5, 6, "此格推来礼义通，一身福禄用无穷；甜酸苦辣皆尝过，滚滚财源盈而丰。"),
  BONE_5_7(5, 7, "福禄丰盈万事全，一身荣耀乐天年；名扬威震人争羡，此世逍遥宛似仙。"),
  BONE_5_8(5, 8, "平生衣食自然来，名利双全富贵偕；金榜题名登甲第，紫袍玉带走金阶。"),
  BONE_5_9(5, 9, "细推此格秀而清，必定才高学业成；甲第之中应有分，扬鞭走马显威荣。"),
  BONE_6_0(6, 0, "一朝金榜快题名，显祖荣宗大器成；衣禄定然无欠缺，田园财帛更丰盈。"),
  BONE_6_1(6, 1, "不作朝中金榜客，定为世上大财翁；聪明天付经书熟，名显高褂自是荣。"),
  BONE_6_2(6, 2, "此命生来福不穷，读书必定显亲宗；紫衣玉带为卿相，富贵荣华孰与同。"),
  BONE_6_3(6, 3, "命主为官福禄长，得来富贵实非常；名题雁塔传金榜，大显门庭天下扬。"),
  BONE_6_4(6, 4, "此格威权不可当，紫袍金带尘高堂；荣华富贵谁能及? 万古留名姓氏扬。"),
  BONE_6_5(6, 5, "细推此命福非轻，富贵荣华孰与争；定国安邦人极品，威声显赫震寰瀛。"),
  BONE_6_6(6, 6, "此格人间一福人，堆金积玉满堂春；从来富贵有天定，金榜题名更显亲。"),
  BONE_6_7(6, 7, "此命生来福自宏，田园家业最高隆；平生衣禄盈丰足，一路荣华万事通。"),
  BONE_6_8(6, 8, "富贵由天莫苦求，万事家计不须谋；十年不比前番事，祖业根基千古留。"),
  BONE_6_9(6, 9, "君是人间福禄星，一生富贵众人钦；总然衣禄由天定，安享荣华过一生。"),
  BONE_7_0(7, 0, "此命推来福不轻，何须愁虑苦劳心；荣华富贵已天定，正笏垂绅拜紫宸。"),
  BONE_7_1(7, 1, "此命生成大不同，公侯卿相在其中；一生自有逍遥福，富贵荣华极品隆。"),
  BONE_7_2(7, 2, "此命推来天下隆，必定人间一主公。富贵荣华数不尽，定为乾坤一蛟龙。"),
  BONE_7_3(7, 3, "此命推来天下隆，必定人间一主公。富贵荣华数不尽，定为乾坤一蛟龙。"),
  ;
  private int liang;
  private int qian;
  private String description;

  private BoneTableEnum(int liang, int qian, String description) {
    this.liang = liang;
    this.qian = qian;
    this.description = description;
  }

  public static BoneTableEnum getByWeight(int liang, int qian) {
    for (BoneTableEnum value : BoneTableEnum.values()) {
      if (value.liang == liang && value.qian == qian) {
        return value;
      }
    }
    return null;
  }

  public int getLiang() {
    return liang;
  }

  public int getQian() {
    return qian;
  }

  public String getDescription() {
    return description;
  }
}
