package com.huyouxiao.space.zhouyi.enums;


/**
 * 甲子太岁辩公金星君 乙丑太岁林公陈星君 丙寅太岁兴公沈星君
 * 丁卯太岁章公耿星君 戊辰太岁达公赵星君 己巳太岁灿公郭星君
 * 庚午太岁清公王星君 辛未太岁熹公李星君 壬申太岁玉公刘星君
 * 癸酉太岁忠公康星君 甲戌太岁广公詹星君 乙亥太岁保公伍星君
 * 丙子太岁嘉公郭星君 丁丑太岁文公汪星君 戊寅太岁光公曾星君
 *
 * 己卯太岁仲公方星君 庚辰太岁德公董星君 辛巳太岁祖公郑星君
 * 壬午太岁明公陆星君 癸未太岁仁公魏星君 甲申太岁杰公方星君
 * 乙酉太岁崇公蒋星君 丙戌太岁敏公白星君 丁亥太济文公封星君
 * 戊子太岁镗公郑星君 己丑太岁佑公潘星君 庚寅太岁柏公邬星君
 * 辛卯太岁宁公范星君 壬辰太岁泰公彭星君 癸巳太岁斝公时星君
 *
 * 甲午太岁嗣公章星君 乙未太岁贤公杨星君 丙申太岁仲公管星君
 * 丁酉太岁杰公唐星君 戊戌太岁武公姜星君 己亥太岁焘公谢星君
 * 庚子太岁超公虞星君 辛丑太岁信公杨星君 壬寅太岁谔公贺星君
 * 癸卯太岁时公皮星君 甲辰太岁成公李星君 乙巳太岁遂公吴星君
 * 丙午太岁祈公文星君 丁未太岁丙公缪星君 戊申太岁昌公俞星君
 *
 * 己酉太岁宝公程星君 庚戌太岁秘公倪星君 辛亥太岁坚公叶星君
 * 壬子太岁德公邶星君 癸丑太岁雍公朱星君 甲寅太岁朝公张星君
 * 乙卯太岁清公万星君 丙辰太岁亚公辛星君 丁巳太济彦公易星君
 * 戊午太岁卿公黎星君 己未太岁傥公傅星君 庚申太岁粹公毛星君
 * 辛酉太岁政公石星君 壬戌太岁克公洪星君 癸亥太岁经公卢星君
 *
 * 甲子金辨 乙丑陈才 丙寅沈兴 丁卯耿章 戊辰赵达 己巳郭灿
 * 庚午王清 辛未李熹 壬申刘旺 癸酉康志 甲戌訾广 乙亥吴保
 * 丙子郭嘉 丁丑汪文 戊寅曾光 己卯龚仲 庚辰章德 辛己郑祖
 * 壬午陆明 癸未魏仁 甲申方杰 乙酉蒋嵩 丙戌白敏 丁亥封济
 * 戊子郑堂 己丑潘佑 庚寅邬桓 辛卯范宁 壬辰彭泰 癸巳徐斝
 *
 * 甲午章诚 乙未杨贤 丙申管仲 丁酉康杰 戊戌姜武 己亥谢焘
 * 庚子卢超 辛丑汤信 壬寅贺谔 癸卯皮时 甲辰李诚 乙巳吴遂
 * 丙午文哲 丁未缪丙 戊申喻志 己酉程实 庚戌猊秘 辛亥叶坚
 * 壬子丘德 癸丑林朴 甲寅张朝 乙卯万清 丙辰辛亚 丁巳易彦
 * 戊午黎卿 己未傅傥 庚申毛梓 辛酉石政 壬戌洪克 癸亥卢程
 */
public enum ZodiacYearEnum {
  ITEM_1(1, "甲子", "金鼠", "甲子太岁辩公金星君", "甲子金辨"),
  ITEM_2(2, "乙丑", "金牛", "乙丑太岁林公陈星君", "乙丑陈才"),
  ITEM_3(3, "丙寅", "火虎", "丙寅太岁兴公沈星君", "丙寅沈兴"),
  ITEM_4(4, "丁卯", "火兔", "丁卯太岁章公耿星君", "丁卯耿章"),
  ITEM_5(5, "戊辰", "木龙", "戊辰太岁达公赵星君", "戊辰赵达"),

  ITEM_6(6, "己巳", "木蛇", "己巳太岁灿公郭星君", "己巳郭灿"),
  ITEM_7(7, "庚午", "土马", "庚午太岁清公王星君", "庚午王清"),
  ITEM_8(8, "辛未", "土羊", "辛未太岁熹公李星君", "辛未李熹"),
  ITEM_9(9, "壬申", "金猴", "壬申太岁玉公刘星君", "壬申刘旺"),
  ITEM_10(10, "癸酉", "金鸡", "癸酉太岁忠公康星君", "癸酉康志"),

  ITEM_11(11, "甲戌", "火狗", "甲戌太岁广公詹星君", "甲戌訾广"),
  ITEM_12(12, "乙亥", "火猪", "乙亥太岁保公伍星君", "乙亥吴保"),
  ITEM_13(13, "丙子", "水鼠", "丙子太岁嘉公郭星君", "丙子郭嘉"),
  ITEM_14(14, "丁丑", "水牛", "丁丑太岁文公汪星君", "丁丑汪文"),
  ITEM_15(15, "戊寅", "土虎", "戊寅太岁光公曾星君", "戊寅曾光"),

  ITEM_16(16, "己卯", "土兔", "己卯太岁仲公方星君", "己卯龚仲"),
  ITEM_17(17, "庚辰", "金龙", "庚辰太岁德公董星君", "庚辰章德"),
  ITEM_18(18, "辛巳", "金蛇", "辛巳太岁祖公郑星君", "辛己郑祖"),
  ITEM_19(19, "壬午", "木马", "壬午太岁明公陆星君", "壬午陆明"),
  ITEM_20(20, "癸未", "木羊", "癸未太岁仁公魏星君", "癸未魏仁"),

  ITEM_21(21, "甲申", "水猴", "甲申太岁杰公方星君", "甲申方杰"),
  ITEM_22(22, "乙酉", "水鸡", "乙酉太岁崇公蒋星君", "乙酉蒋嵩"),
  ITEM_23(23, "丙戌", "土狗", "丙戌太岁敏公白星君", "丙戌白敏"),
  ITEM_24(24, "丁亥", "土猪", "丁亥太济文公封星君", "丁亥封济"),
  ITEM_25(25, "戊子", "火鼠", "戊子太岁镗公郑星君", "戊子郑堂"),

  ITEM_26(26, "己丑", "火牛", "己丑太岁佑公潘星君", "己丑潘佑"),
  ITEM_27(27, "庚寅", "木虎", "庚寅太岁柏公邬星君", "庚寅邬桓"),
  ITEM_28(28, "辛卯", "木兔", "辛卯太岁宁公范星君", "辛卯范宁"),
  ITEM_29(29, "壬辰", "水龙", "壬辰太岁泰公彭星君", "壬辰彭泰"),
  ITEM_30(30, "癸巳", "水蛇", "癸巳太岁斝公时星君", "癸巳徐斝"),

  ITEM_31(31, "甲午", "金马", "甲午太岁嗣公章星君", "甲午章诚"),
  ITEM_32(32, "乙未", "金羊", "乙未太岁贤公杨星君", "乙未杨贤"),
  ITEM_33(33, "丙申", "火猴", "丙申太岁仲公管星君", "丙申管仲"),
  ITEM_34(34, "丁酉", "火鸡", "丁酉太岁杰公唐星君", "丁酉康杰"),
  ITEM_35(35, "戊戌", "木狗", "戊戌太岁武公姜星君", "戊戌姜武"),

  ITEM_36(36, "己亥", "木猪", "己亥太岁焘公谢星君", "己亥谢焘"),
  ITEM_37(37, "庚子", "土鼠", "庚子太岁超公虞星君", "庚子卢超"),
  ITEM_38(38, "辛丑", "土牛", "辛丑太岁信公杨星君", "辛丑汤信"),
  ITEM_39(39, "壬寅", "金虎", "壬寅太岁谔公贺星君", "壬寅贺谔"),
  ITEM_40(40, "癸卯", "金兔", "癸卯太岁时公皮星君", "癸卯皮时"),

  ITEM_41(41, "甲辰", "火龙", "甲辰太岁成公李星君", "甲辰李诚"),
  ITEM_42(42, "乙巳", "火蛇", "乙巳太岁遂公吴星君", "乙巳吴遂"),
  ITEM_43(43, "丙午", "水马", "丙午太岁祈公文星君", "丙午文哲"),
  ITEM_44(44, "丁未", "水羊", "丁未太岁丙公缪星君", "丁未缪丙"),
  ITEM_45(45, "戊申", "土猴", "戊申太岁昌公俞星君", "戊申喻志"),

  ITEM_46(46, "己酉", "土鸡", "己酉太岁宝公程星君", "己酉程实"),
  ITEM_47(47, "庚戌", "金狗", "庚戌太岁秘公倪星君", "庚戌猊秘"),
  ITEM_48(48, "辛亥", "金猪", "辛亥太岁坚公叶星君", "辛亥叶坚"),
  ITEM_49(49, "壬子", "木鼠", "壬子太岁德公邶星君", "壬子丘德"),
  ITEM_50(50, "癸丑", "木牛", "癸丑太岁雍公朱星君", "癸丑林朴"),

  ITEM_51(51, "甲寅", "水虎", "甲寅太岁朝公张星君", "甲寅张朝"),
  ITEM_52(52, "乙卯", "水兔", "乙卯太岁清公万星君", "乙卯万清"),
  ITEM_53(53, "丙辰", "土龙", "丙辰太岁亚公辛星君", "丙辰辛亚"),
  ITEM_54(54, "丁巳", "土蛇", "丁巳太济彦公易星君", "丁巳易彦"),
  ITEM_55(55, "戊午", "火马", "戊午太岁卿公黎星君", "戊午黎卿"),

  ITEM_56(56, "己未", "火羊", "己未太岁傥公傅星君", "己未傅傥"),
  ITEM_57(57, "庚申", "木猴", "庚申太岁粹公毛星君", "庚申毛梓"),
  ITEM_58(58, "辛酉", "木鸡", "辛酉太岁政公石星君", "辛酉石政"),
  ITEM_59(59, "壬戌", "水狗", "壬戌太岁克公洪星君", "壬戌洪克"),
  ITEM_60(60, "癸亥", "水猪", "癸亥太岁经公卢星君", "癸亥卢程"),
      ;
  private int number;
  private String yearName;
  private String zodiac;
  private String god;
  private String godName;

  public int getNumber() {
    return number;
  }

  public String getYearName() {
    return yearName;
  }

  public String getZodiac() {
    return zodiac;
  }

  public String getGod() {
    return god;
  }

  public String getGodName() {
    return godName;
  }

  private ZodiacYearEnum(int number, String yearName, String zodiac, String god, String godName){
    this.number = number;
    this.yearName = yearName;
    this.zodiac = zodiac;
    this.god = god;
    this.godName = godName;
  }

  public static ZodiacYearEnum getByYearName(String yearName) {
    for (ZodiacYearEnum item : ZodiacYearEnum.values()) {
      if (item.yearName.equals(yearName)) {
        return item;
      }
    }
    return null;
  }
}
